#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.cdn.azurerm_dns_a_record.this will be updated in-place
  ~ resource "azurerm_dns_a_record" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/wallet.io.pagopa.it/A/@"
        name                = "@"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      ~ ttl                 = 30 -> 3600
        # (5 unchanged attributes hidden)
    }

  # module.ids.azurerm_user_assigned_identity.psn_01 will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "psn_01" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-psn-id-01"
        name                = "io-p-itn-wallet-psn-id-01"
      ~ tags                = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (5 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
                # (1 unchanged element hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
                # (6 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.cosmos is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      - account_name        = "io-p-itn-wallet-cosno-02" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleAssignments/a80e39bc-0c11-1486-6e68-dc725a21a005" -> null
      - name                = "a80e39bc-0c11-1486-6e68-dc725a21a005" -> null
      - principal_id        = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|owner"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.key_vault is not in configuration)
  - resource "azurerm_role_assignment" "secrets" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/0824800f-0b76-763a-59ba-21f87c48b336" -> null
      - name                                   = "0824800f-0b76-763a-59ba-21f87c48b336" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> null
      - role_definition_name                   = "Key Vault Secrets Officer" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|owner"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account is not in configuration)
  - resource "azurerm_role_assignment" "blob" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/providers/Microsoft.Authorization/roleAssignments/777a1adc-30eb-c2e8-6503-6aacbdd2c177" -> null
      - name                                   = "777a1adc-30eb-c2e8-6503-6aacbdd2c177" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account is not in configuration)
  - resource "azurerm_role_assignment" "queue" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/5f234d1a-e5b5-a103-6aaf-44de1b4994d3" -> null
      - name                                   = "5f234d1a-e5b5-a103-6aaf-44de1b4994d3" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account is not in configuration)
  - resource "azurerm_role_assignment" "queue" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/848458b0-961a-b076-d6b2-c64fb903ce05" -> null
      - name                                   = "848458b0-961a-b076-d6b2-c64fb903ce05" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name                   = "Storage Queue Data Message Processor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (4 unchanged attributes hidden)
    }

  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account is not in configuration)
  - resource "azurerm_role_assignment" "queue" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/79149895-7605-04ba-f536-ff635c9f0c4e" -> null
      - name                                   = "79149895-7605-04ba-f536-ff635c9f0c4e" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/19e7f393-937e-4f77-808e-94535e297925" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be destroyed
  # (because module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account is not in configuration)
  - resource "azurerm_role_assignment" "queue" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/d7c89bdf-ec61-382c-3409-bde239499aeb" -> null
      - name                                   = "d7c89bdf-ec61-382c-3409-bde239499aeb" -> null
      - principal_id                           = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name                   = "Storage Queue Data Message Sender" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 5 to change, 7 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
